{
  "title": "Delegating Decisions in Strategic Settings",
  "authors": [
    "Paul E. Dunne",
    "Paul Harrenstein",
    "Sarit Kraus",
    "Michael Wooldridge"
  ],
  "year": "2020-08",
  "editing": false,
  "labels": [
    "game theory"
  ],
  "abstract": "Our research concerns the ubiquitous prob- lem of how to incentivise agents to decide on courses of action that are simultaneously desirable from the global perspective and rational from a local game-theoretic perspective. The design of mechanisms so as to achieve this is through steering the strategic capabilities of interested agents by delegating decisions to them in specific ways. We distinguish the cases in which the delegation is effectuated by a principal and where the agents are delegating decisions among one another. Our reliance on the mathematical framework of Boolean games to formalise the principal and distributed delegation problems offers valuable insights into the computational complexity of these problems. The delegation problem touches on many important applications, not only in everyday life, but also in Artificial Intelligence, in particular Multi-Agent Systems.",
  "summaries": [
    "__formalize principal and distributed delegation problems via Boolean games__ to incentivise agents to decide on courses of action that are simultaneously desirable from the global perspective and rational from a local game-theoretic perspective",
    "_Problem1_: in principal delegation problem, the principal determines how decisions will be delegated",
    "_Problem2_: in distributed delegation problem, agents can delegate decisions among themselves",
    "_Solution_: the authors formalise these problems using Boolean games and decisions are directly represented as Boolean variables. The objective is to incentivise agents to decide on courses of action that are simultaneously desirable from the global perspective and rational from a local game-theoretic perspective.",
    "FL: for an FL community, to hire more data owners or not, improve the data quality of current data owners"
  ],
  "systemModel": [
    "Example 1",
    [
      "Department",
      [
        "Finance: raise taxes or not",
        "Trade: free-trade agreement with A or B",
        "Energy: coal phase-out or other measures"
      ],
      "Candidate",
      [
        "environmentalist: green outcomes (coal phase-out and renewable energy sources like wind and solar)",
        "free-trade libertarian: no raise taxes, unless trade with B and no coal phase-out",
        "populist: trade with B, or trade with A if it leads to a green economy"
      ]
    ]
  ],
  "techniques": [],
  "doi": "10.1109/TAI.2020.3031545",
  "id": "dunne2020delegating",
  "bibtex": "@article{dunne2020delegating, title={Delegating Decisions in Strategic Settings}, author={Dunne, Paul E and Harrenstein, Paul and Kraus, Sarit and Wooldridge, Michael}, journal={IEEE Transactions on Artificial Intelligence}, volume={1}, number={1}, pages={19--33}, year={2020}, publisher={IEEE}}"
}