{
  "title": "OpenFL: the open federated learning library",
  "authors": [
    "Patrick Foley",
    "Micah J Sheller",
    "Brandon Edwards",
    "Sarthak Pati",
    "Walter Riviera",
    "Mansi Sharma",
    "Prakash Narayana Moorthy",
    "Shih-han Wang",
    "Jason Martin",
    "Parsa Mirhaji",
    "Prashant Shah",
    "Spyridon Bakas"
  ],
  "type":"technical",
  "year": "2022-05",
  "editing": false,
  "labels": [
    "federated learning",
    "FL platform",
    "healthcare"
  ],
  "abstract": "Federated learning (FL) is a computational paradigm that enables organizations to collaborate on machine learning (ML) and deep learning (DL) projects without sharing sensitive data, such as patient records, financial data, or classified secrets. Open federated learning (OpenFL) framework is an open-source python-based tool for training ML/DL algorithms using the data-private collaborative learning paradigm of FL, irrespective of the use case. OpenFL works with training pipelines built with both TensorFlow and PyTorch, and can be easily extended to other ML and DL frameworks. In this manuscript, we present OpenFL and summarize its motivation and development characteristics, with the intention of facilitating its application to existing ML/DL model training in a production environment. We further provide recommendations to secure a federation using trusted execution environments to ensure explicit model security and integrity, as well as maintain data confidentiality. Finally, we describe the first real-world healthcare federations that use the OpenFL library, and highlight how it can be applied to other non-healthcare use cases. The OpenFL library is designed for real world scalability, trusted execution, and also prioritizes easy migration of centralized ML models into a federated training pipeline. Although OpenFL's initial use case was in healthcare, it is applicable beyond this domain and is now reaching wider adoption both in research and production settings. The tool is open-sourced at github.com/intel/openfl.",
  "summaries": [
    "in the conventional FL framework, [1] develop __an FL framework__ that ensures model security and integrity, and data confidentiality, [2] __apply this framework in a real-world healthcare scenario__"
  ],
  "systemModel": [
    "workflow of OpenFL",
    [
      "install OpenFL in all nodes<ol>",
      "create FL workspace (configurate, plan, and code) on aggregator",
      "move the workspace to all nodes of the federation",
      "ensure every node has valid PKI certificate",
      "initiate the nodes"
    ],
    "security is enhanced via a mutual transport layer security (mTLS)",
    "connection is built with gRPC",
    "a real-world federated tumor segmentation initiative and acute respiratory distress syndrome prediction, which leverage OpenFL, are described"
  ],
  "techniques": [
    ""
  ],
  "doi": "10.1088/1361-6560/ac97d9",
  "id": "foley2022openfl",
  "bibtex": "@article{foley2022openfl, title={OpenFL: the open federated learning library}, author={Foley, Patrick and Sheller, Micah J and Edwards, Brandon and Pati, Sarthak and Riviera, Walter and Sharma, Mansi and Moorthy, Prakash Narayana and Wang, Shih-han and Martin, Jason and Mirhaji, Parsa and others}, journal={Physics in Medicine \\& Biology}, volume={67}, number={21}, pages={214001}, year={2022}, publisher={IOP Publishing}}"
}