{
  "title": "A secure federated learning framework for 5G networks",
  "authors": [
    "Yi Liu",
    "Jialiang Peng",
    "Jiawen Kang",
    "Abdullah M. Iliyasu",
    "Dusit Niyato",
    "Ahmed A. Abd El-Latif"
  ],
  "type": "technical",
  "year": "2020-08",
  "editing": false,
  "labels": [
    "federated learning",
    "security",
    "blockchain",
    "smart contract"
  ],
  "summaries": [
    "in the conventional FL framework, employ __a smart contract to [1] guide FL and [2] verify local models with a hashed testing dataset__ provided by the task publisher, to recognize malicious participants.",
    "in the smart contract, a testing dataset is used to evaluate the accuracy performance of uploaded model updates. Consequently, those unreliable participants will be detected",
    "moreover, monetary reward criteria are written in the smart contract to incentivize efforts of high-quality model updates"
  ],
  "systemModel": [
    "Phases",
    [
      "smart contracts, wallet address, task publisher, central aggregator, devices",
      "phase 1 (initialization) step 1): the task publisher creates a smart contract (including a hashed testing dataset, an initial global model) in the blockchain",
      "phase 1 (initialization) step 2): the task publisher provides hashed indices of the data group to the central aggregator",
      "phase 1 (initialization) step 3): the central aggregator verifies the testing data group and writes the testing data group into the smart contract, while devices downloads the initial global model",
      "phase 2 (aggregation) step 1): devices do local training with D-SGD algorithm",
      "phase 2 (aggregation) step 2): devices add Gaussian noise mechanism (GNM) to add noise on the local model updates prior to submission to the central aggregator",
      "phase 2 (aggregation) step 3): the central aggregator evaluates local models",
      "phase 3 (update): after the convergence of the global model or number of iteration reaches the upper limit, the qualified devices will obtain rewards from blockchain and the task publisher will receive a new, better global model"
    ]
  ],
  "techniques": [],
  "doi": "10.1109/MWC.01.1900525",
  "id": "liu2020secure",
  "bibtex": "@article{liu2020secure, title={A secure federated learning framework for 5G networks}, author={Liu, Yi and Peng, Jialiang and Kang, Jiawen and Iliyasu, Abdullah M and Niyato, Dusit and Abd El-Latif, Ahmed A}, journal={IEEE Wireless Communications}, volume={27}, number={4}, pages={24--31}, year={2020}, publisher={IEEE}}"
}